cf_billing/Enums/бестЦеновыеКатегории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестЦеновыеКатегории</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерваяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтораяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетвертаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШестаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Население</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/бестРаботаСТочкамиУчетаНПКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// При изменении вида канальности заполняет ТЧ ШкалыУслу.
//
// Параметры:
//  Форма		-	ФормаКлиентскогоПриложения.
//  ТекДанные	-	ДанныеФормыЭлементКоллекции.
//  Услуги		-	Массив						-	массив из Структур("Услуга, Шкала").
//  ИмяТабЧасти	-	Строка.
//  ДанныеФормы	-	Булево.
//
Процедура ПриИзмененииВидаКанальности(Форма, ТекДанные, Услуги, ИмяТабЧасти, ДанныеФормы  = Ложь) Экспорт 
	
	Если не ЗначениеЗаполнено(ТекДанные.IDСтроки) тогда
		ТекДанные.IDСтроки 					= Новый УникальныйИдентификатор;
	КонецЕсли;
		
	Если не ДанныеФормы тогда 
		Коллекция 							= Форма.Объект[ИмяТабЧасти];	
	иначе
		Коллекция 							= Форма[ИмяТабЧасти];
	КонецЕсли;
	
	// Ищем строки по индентификатору
	СтруктураПоиска  						= Новый Структура("IDСтроки",ТекДанные.IDСтроки);
	СтрокиСоотвествия 						= Коллекция.НайтиСтроки(СтруктураПоиска);	
	 
	для Каждого СтрокаСоотвествия из СтрокиСоотвествия цикл
		Коллекция.Удалить(СтрокаСоотвествия);
	КонецЦикла;  	 
	
	Если Услуги.количество()  = 0 тогда
		Возврат;
	КонецЕсли;
	
	для Каждого СтрокаСостава из Услуги цикл		
		СтрокаПоказаний 						= Коллекция.добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, СтрокаСостава);
		СтрокаПоказаний.IDСтроки 				= ТекДанные.IDСтроки;
	КонецЦикла;	
	
	
КонецПроцедуры

// Возвращает список ценовых категорий.
//
// Параметры:
//  МаксимальнаяМощностьИтог	-	Число	-	итог максимальной мощности.
// 
// Возвращаемое значение:
//  Массив	-	список ценовых категорий.
//
Функция ПолучитьСписокЦК(МаксимальнаяМощностьИтог) Экспорт
	мЦК = Новый Массив;
	Если МаксимальнаяМощностьИтог < 670 Тогда
		мЦК.Добавить(ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.ПерваяЦК"));
		мЦК.Добавить(ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.ВтораяЦК"));
	КонецЕсли;
	мЦК.Добавить(ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.ТретьяЦК"));
	мЦК.Добавить(ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК"));
	мЦК.Добавить(ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.ПятаяЦК"));
	мЦК.Добавить(ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.ШестаяЦК"));
	мЦК.Добавить(ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.Население"));
	Возврат мЦК;
КонецФункции

#Область ДобавлениеСубабонентов

// Возвращает начальные параметры передачи для узлов.
// Инициализация параметров открытия формы добавления субабонентов.
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения.
//  ТекущиеДанные	-	ДанныеФормыЭлементКоллекции.
//  ТекущийОбъект	-	ДанныеФормыСтруктура.
//  Транзит			-	Булево.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ВернутьНачальныеПараметрыПередачиДляУзлов(Форма, ТекущиеДанные, ТекущийОбъект, Транзит = Ложь) Экспорт 
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("IDСтроки"		, ТекущиеДанные.IDСтроки);
	ДополнительныеПараметры.Вставить("ТекущийОбъект", ТекущийОбъект);
	ДополнительныеПараметры.Вставить("Форма"		, Форма);
	
	ПараметрыПередачи = новый Структура;
	ПараметрыПередачи.Вставить("IDСтроки"			,ТекущиеДанные.IDСтроки); 
	ПараметрыПередачи.Вставить("ДолеваяТочкаУчета"	,ТекущиеДанные.НаименованиеТочки);
	ПараметрыПередачи.Вставить("Организация"		,ТекущийОбъект.Организация);
	ПараметрыПередачи.Вставить("Дата"				,ТекущийОбъект.Дата); 
	ПараметрыПередачи.Вставить("Район"				,ТекущийОбъект.Район);
	ПараметрыПередачи.Вставить("Транзит"			,Транзит);
	
	Возврат Новый Структура("ПараметрыПередачи,ДополнительныеПараметры",ПараметрыПередачи,ДополнительныеПараметры);
КонецФункции

// Добавляет субабонентов.
// Открытие формы добавления субабонентов.
//
// Параметры:
//  СтруктураОтвета		-	Структура.
//
Процедура ДобавитьСубабонентов(СтруктураОтвета) Экспорт 
	
	ДополнительныеПараметры = СтруктураОтвета.ДополнительныеПараметры;
	ПараметрыПередачи 		= СтруктураОтвета.ПараметрыПередачи;	
	ОписаниеЗаверешения  	= Новый ОписаниеОповещения("ЗавершениеРаботыСФормойСубабонентов",ЭтотОбъект,ДополнительныеПараметры);	
	
	ОткрытьФорму("ОбщаяФорма.бестФормаСубабонентов",ПараметрыПередачи,,,,,ОписаниеЗаверешения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Завершение работы с формой субабонентов.
//
// Параметры:
//  Результат					-	Соответствие	-	результат выбора из формы.
//  ДополнительныеПараметры		-	Структура:
//  									* Форма			-	ФормаКлиентскогоПриложения	-	ссылка на форму, из которой была вызвана форма выбора.
//  									* ТекущийОбъект	-	Документ/Справочник			-	текущий редактируемый объект.
//  									* IDСтроки		-	УникальныйИдентификатор		-	идентификатор строки табличной части,
//  																					для которой производился выбор субабонентов.
Процедура ЗавершениеРаботыСФормойСубабонентов(Результат, ДополнительныеПараметры) Экспорт 
	
	Если не Результат = Неопределено Тогда
		ДополнительныеПараметры.Форма.Модифицированность 	= Истина;
		ТекущийОбъект 										= ДополнительныеПараметры.ТекущийОбъект;
		
		// Очистка всех зависимых строк по ТУ
		ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ДополнительныеПараметры.IDСтроки, ТекущийОбъект);
		
		// Добавление строк
		Для Каждого ТекСтрока из Результат Цикл
			ЗаполнитьТЧИзПараметров(ТекСтрока.Значение,ТекущийОбъект[ТекСтрока.Ключ]);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет очистку зависимых строк по ID строки.
//
// Параметры:
//  IDСтроки		-	УникальныйИдентификатор.
//  ТекущийОбъект	-	ФормаКлиентскогоПриложения.
//
Процедура ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(IDСтроки, ТекущийОбъект) Экспорт 
	ОтборIDСтроки 			= Новый Структура("IDСтроки"			,IDСтроки);
	
	УдалитьЗависимыеСтрокиПоСквозномуID(ТекущийОбъект.Субабоненты			,ОтборIDСтроки);
КонецПроцедуры

#КонецОбласти

// Получает расшифровку мощности.
//
// Параметры:
//  МаксимальнаяМощностьИтог	-	Число.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьРасшифровкуМощности(МаксимальнаяМощностьИтог) Экспорт
	Текст = "";
	Если МаксимальнаяМощностьИтог < 150 Тогда
		Текст = "менее 150 кВт";
	ИначеЕсли МаксимальнаяМощностьИтог >= 150 и МаксимальнаяМощностьИтог < 670 Тогда
		Текст = "от 150 кВт до 670 кВт";
	ИначеЕсли МаксимальнаяМощностьИтог >= 670 и МаксимальнаяМощностьИтог < 10000 Тогда
		Текст = "от 670 кВт до 10 МВт";
	ИначеЕсли МаксимальнаяМощностьИтог >= 10000 Тогда
		Текст = "более 10 МВт";
	КонецЕсли;
	Возврат Текст;
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьЗависимыеСтрокиПоСквозномуID(Таблица,Отбор)
	
	СтрокиТЧ 	= Таблица.найтиСтроки(Отбор);
	для Каждого СтрокаТЧ из СтрокиТЧ цикл
		Таблица.удалить(СтрокаТЧ);
	КонецЦикла;   	  
	
КонецПроцедуры

Процедура ЗаполнитьТЧИзПараметров(ТабЧастьИзДокумента,Таблица)
	Для Каждого ТекСтрока из ТабЧастьИзДокумента Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		Если ТипЗнч(ТекСтрока.Договор) = Тип("СправочникСсылка.энргАбоненты") Тогда
			НоваяСтрока.Абонент = ТекСтрока.Договор;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
